; domain
(define (domain zeno-travel)
(:requirements :typing :fluents)
(:types aircraft person city - object)
(:predicates (at ?x - (either person aircraft) ?c - city)
             (in ?p - person ?a - aircraft))
(:functions (fuel ?a - aircraft)
            (distance ?c1 - city ?c2 - city)
            (slow-burn ?a - aircraft)
            (fast-burn ?a - aircraft)
            (capacity ?a - aircraft)
            (total-fuel-used)
	    (onboard ?a - aircraft)
            (zoom-limit ?a - aircraft)
            )


(:action board
 :parameters (?p - person ?a - aircraft ?c - city)
 :precondition (and (at ?p ?c)
                 (at ?a ?c))
 :effect (and (not (at ?p ?c))
              (in ?p ?a)
		(increase (onboard ?a) 1)))


(:action debark
 :parameters (?p - person ?a - aircraft ?c - city)
 :precondition (and (in ?p ?a)
                 (at ?a ?c))
 :effect (and (not (in ?p ?a))
              (at ?p ?c)
		(decrease (onboard ?a) 1)))

(:action fly 
 :parameters (?a - aircraft ?c1 ?c2 - city)
 :precondition (and (at ?a ?c1)
                 (>= (fuel ?a) 
                         (* (distance ?c1 ?c2) (slow-burn ?a))))
 :effect (and (not (at ?a ?c1))
              (at ?a ?c2)
              (increase (total-fuel-used)
                         (* (distance ?c1 ?c2) (slow-burn ?a)))
              (decrease (fuel ?a) 
                         (* (distance ?c1 ?c2) (slow-burn ?a)))))
                                  
(:action zoom
 :parameters (?a - aircraft ?c1 ?c2 - city)
 :precondition (and (at ?a ?c1)
                 (>= (fuel ?a) 
                         (* (distance ?c1 ?c2) (fast-burn ?a)))
                 (<= (onboard ?a) (zoom-limit ?a)))
 :effect (and (not (at ?a ?c1))
              (at ?a ?c2)
              (increase (total-fuel-used)
                         (* (distance ?c1 ?c2) (fast-burn ?a)))
              (decrease (fuel ?a) 
                         (* (distance ?c1 ?c2) (fast-burn ?a)))
	)
) 

(:action refuel	
 :parameters (?a - aircraft ?c - city)
 :precondition (and (> (capacity ?a) (fuel ?a))
               (at ?a ?c)
		)
 :effect (and (assign (fuel ?a) (capacity ?a)))
)


)

; problem
(define (problem ZTRAVEL-2-3)
(:domain zeno-travel)
(:objects
	plane1 - aircraft
	plane2 - aircraft
	person1 - person
	person2 - person
	person3 - person
	city0 - city
	city1 - city
	city2 - city
	city3 - city
	city4 - city
	city5 - city
	city6 - city
	city7 - city
	city8 - city
	city9 - city
	)
(:init
	(at plane1 city3)
	(= (capacity plane1) 2838)
	(= (fuel plane1) 19)
	(= (slow-burn plane1) 1)
	(= (fast-burn plane1) 3)
	(= (onboard plane1) 0)
	(= (zoom-limit plane1) 1)
	(at plane2 city8)
	(= (capacity plane2) 7012)
	(= (fuel plane2) 2198)
	(= (slow-burn plane2) 3)
	(= (fast-burn plane2) 8)
	(= (onboard plane2) 0)
	(= (zoom-limit plane2) 4)
	(at person1 city4)
	(at person2 city0)
	(at person3 city3)
	(= (distance city0 city0) 0)
	(= (distance city0 city1) 695)
	(= (distance city0 city2) 511)
	(= (distance city0 city3) 573)
	(= (distance city0 city4) 972)
	(= (distance city0 city5) 588)
	(= (distance city0 city6) 606)
	(= (distance city0 city7) 826)
	(= (distance city0 city8) 927)
	(= (distance city0 city9) 714)
	(= (distance city1 city0) 695)
	(= (distance city1 city1) 0)
	(= (distance city1 city2) 591)
	(= (distance city1 city3) 717)
	(= (distance city1 city4) 815)
	(= (distance city1 city5) 644)
	(= (distance city1 city6) 643)
	(= (distance city1 city7) 542)
	(= (distance city1 city8) 644)
	(= (distance city1 city9) 825)
	(= (distance city2 city0) 511)
	(= (distance city2 city1) 591)
	(= (distance city2 city2) 0)
	(= (distance city2 city3) 579)
	(= (distance city2 city4) 671)
	(= (distance city2 city5) 803)
	(= (distance city2 city6) 940)
	(= (distance city2 city7) 883)
	(= (distance city2 city8) 908)
	(= (distance city2 city9) 820)
	(= (distance city3 city0) 573)
	(= (distance city3 city1) 717)
	(= (distance city3 city2) 579)
	(= (distance city3 city3) 0)
	(= (distance city3 city4) 784)
	(= (distance city3 city5) 641)
	(= (distance city3 city6) 502)
	(= (distance city3 city7) 521)
	(= (distance city3 city8) 964)
	(= (distance city3 city9) 852)
	(= (distance city4 city0) 972)
	(= (distance city4 city1) 815)
	(= (distance city4 city2) 671)
	(= (distance city4 city3) 784)
	(= (distance city4 city4) 0)
	(= (distance city4 city5) 918)
	(= (distance city4 city6) 659)
	(= (distance city4 city7) 864)
	(= (distance city4 city8) 991)
	(= (distance city4 city9) 631)
	(= (distance city5 city0) 588)
	(= (distance city5 city1) 644)
	(= (distance city5 city2) 803)
	(= (distance city5 city3) 641)
	(= (distance city5 city4) 918)
	(= (distance city5 city5) 0)
	(= (distance city5 city6) 952)
	(= (distance city5 city7) 598)
	(= (distance city5 city8) 958)
	(= (distance city5 city9) 879)
	(= (distance city6 city0) 606)
	(= (distance city6 city1) 643)
	(= (distance city6 city2) 940)
	(= (distance city6 city3) 502)
	(= (distance city6 city4) 659)
	(= (distance city6 city5) 952)
	(= (distance city6 city6) 0)
	(= (distance city6 city7) 812)
	(= (distance city6 city8) 549)
	(= (distance city6 city9) 597)
	(= (distance city7 city0) 826)
	(= (distance city7 city1) 542)
	(= (distance city7 city2) 883)
	(= (distance city7 city3) 521)
	(= (distance city7 city4) 864)
	(= (distance city7 city5) 598)
	(= (distance city7 city6) 812)
	(= (distance city7 city7) 0)
	(= (distance city7 city8) 628)
	(= (distance city7 city9) 694)
	(= (distance city8 city0) 927)
	(= (distance city8 city1) 644)
	(= (distance city8 city2) 908)
	(= (distance city8 city3) 964)
	(= (distance city8 city4) 991)
	(= (distance city8 city5) 958)
	(= (distance city8 city6) 549)
	(= (distance city8 city7) 628)
	(= (distance city8 city8) 0)
	(= (distance city8 city9) 740)
	(= (distance city9 city0) 714)
	(= (distance city9 city1) 825)
	(= (distance city9 city2) 820)
	(= (distance city9 city3) 852)
	(= (distance city9 city4) 631)
	(= (distance city9 city5) 879)
	(= (distance city9 city6) 597)
	(= (distance city9 city7) 694)
	(= (distance city9 city8) 740)
	(= (distance city9 city9) 0)
	(= (total-fuel-used) 0)
)
(:goal (and
	(at person1 city2)
	(at person2 city3)
	(at person3 city7)
	))

(:metric minimize (+ (* 3 (total-time))  (* 4 (total-fuel-used))))
)

; plan
1. (board person3 plane1 city3)
   deleted: (at person3 city3)
   added: (in person3 plane1)
   changed: (onboard plane1) from 0 to 1
   goals met: 0 of 3
2. (refuel plane1 city3)
   changed: (fuel plane1) from 19 to 2838
   goals met: 0 of 3
3. (zoom plane1 city3 city0)
   deleted: (at plane1 city3)
   added: (at plane1 city0)
   changed: (total-fuel-used) from 0 to 1719, (fuel plane1) from 2838 to 1119
   goals met: 0 of 3
4. (board person2 plane1 city0)
   deleted: (at person2 city0)
   added: (in person2 plane1)
   changed: (onboard plane1) from 1 to 2
   goals met: 0 of 3
5. (fly plane1 city0 city7)
   deleted: (at plane1 city0)
   added: (at plane1 city7)
   changed: (total-fuel-used) from 1719 to 2545, (fuel plane1) from 1119 to 293
   goals met: 0 of 3
6. (debark person3 plane1 city7)
   deleted: (in person3 plane1)
   added: (at person3 city7)
   changed: (onboard plane1) from 2 to 1
   goals met: 1 of 3
7. (refuel plane1 city7)
   changed: (fuel plane1) from 293 to 2838
   goals met: 1 of 3
8. (fly plane1 city7 city3)
   deleted: (at plane1 city7)
   added: (at plane1 city3)
   changed: (total-fuel-used) from 2545 to 3066, (fuel plane1) from 2838 to 2317
   goals met: 1 of 3
9. (debark person2 plane1 city3)
   deleted: (in person2 plane1)
   added: (at person2 city3)
   changed: (onboard plane1) from 1 to 0
   goals met: 2 of 3
10. (fly plane1 city3 city4)
   deleted: (at plane1 city3)
   added: (at plane1 city4)
   changed: (total-fuel-used) from 3066 to 3850, (fuel plane1) from 2317 to 1533
   goals met: 2 of 3
11. (board person1 plane1 city4)
   deleted: (at person1 city4)
   added: (in person1 plane1)
   changed: (onboard plane1) from 0 to 1
   goals met: 2 of 3
12. (fly plane1 city4 city2)
   deleted: (at plane1 city4)
   added: (at plane1 city2)
   changed: (total-fuel-used) from 3850 to 4521, (fuel plane1) from 1533 to 862
   goals met: 2 of 3
13. (debark person1 plane1 city2)
   deleted: (in person1 plane1)
   added: (at person1 city2)
   changed: (onboard plane1) from 1 to 0
   goals met: 3 of 3
